Table of Contents
 Interface IGrpcBlobStorageClient
Namespace
IdeaStatiCa.Plugin.Grpc
Assembly
IdeaStatiCa.Plugin.dll
public interface IGrpcBlobStorageClient
Methods
 DeleteAsync(string, string)
Task DeleteAsync(string blobStorageId, string contentId)
Parameters
blobStorageId string
contentId string
Returns
Task
 Dispose()
void Dispose()
 ExistAsync(string, string)
Task<bool> ExistAsync(string blobStorageId, string contentId)
Parameters
blobStorageId string
contentId string
Returns
Task<bool>
 GetEntriesAsync(string)
Task<List<string>> GetEntriesAsync(string blobStorageId)
Parameters
blobStorageId string
Returns
Task<List<string>>
 ReadAsync(string, string)
Task<Stream> ReadAsync(string blobStorageId, string contentId)
Parameters
blobStorageId string
contentId string
Returns
Task<Stream>
 WriteAsync(string, string, Stream)
Task WriteAsync(string blobStorageId, string contentId, Stream content)
Parameters
blobStorageId string
contentId string
content Stream
Returns
Task
 Edit this page